<?php

return [
    [
        "name" => "水瓶座",
        "birth" => "01/20~02/18"
    ],
    [
        "name" => "雙魚座",
        "birth" => "02/19~03/20"
    ],
    [
        "name" => "牡羊座",
        "birth" => "03/21~04/19"
    ],
    [
        "name" => "金牛座",
        "birth" => "04/20~05/20"
    ],
    [
        "name" => "雙子座",
        "birth" => "05/21~06/21"
    ],
    [
        "name" => "巨蟹座",
        "birth" => "06/22~07/22"
    ],
    [
        "name" => "獅子座",
        "birth" => "07/23~08/22"
    ],
    [
        "name" => "處女座",
        "birth" => "08/23~09/22"
    ],
    [
        "name" => "天秤座",
        "birth" => "09/23~10/23"
    ],
    [
        "name" => "天蠍座",
        "birth" => "10/24~11/22"
    ],
    [
        "name" => "射手座",
        "birth" => "11/23~12/21"
    ],
    [
        "name" => "摩羯座",
        "birth" => "12/22~01/19"
    ]
];
