-- MySQL dump 10.13  Distrib 8.0.17, for macos10.14 (x86_64)
--
-- Host: 127.0.0.1    Database: laravel
-- ------------------------------------------------------
-- Server version	8.0.21

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `fortune`
--

DROP TABLE IF EXISTS `fortune`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `fortune` (
  `id` bigint unsigned NOT NULL AUTO_INCREMENT,
  `astro_id` bigint unsigned NOT NULL,
  `dailyDate` date NOT NULL,
  `overallStar` int NOT NULL,
  `loveStar` int NOT NULL,
  `careerStar` int NOT NULL,
  `wealthStar` int NOT NULL,
  `overallText` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `loveText` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `careerText` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `wealthText` longtext COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `fortune_astro_id_foreign` (`astro_id`),
  CONSTRAINT `fortune_astro_id_foreign` FOREIGN KEY (`astro_id`) REFERENCES `astro` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fortune`
--

LOCK TABLES `fortune` WRITE;
/*!40000 ALTER TABLE `fortune` DISABLE KEYS */;
INSERT INTO `fortune` VALUES (25,1,'2020-09-03',3,3,3,3,'創業者今天會遇上有背景且財力雄厚之人，對你將來的事業很有助益。有專長者會得到意外機遇，不僅提升了專業技能，也豐富了自己的生活。戀愛中的人有機會遇上極具魅力的異性，戀情出現小波折。','異性緣佳，單身者與異性吃喝玩樂的時間增多，但是想戀愛還需耐心等待。','工作上，中規中矩地完成上司交付的工作就能獲得嘉獎，給人踏實勤勉的印象。','花錢慾望強烈，喜歡在朋友面前擺闊，小心透支。','2020-09-03 03:25:01','2020-09-03 03:25:01'),(26,2,'2020-09-03',2,3,1,2,'總感覺不安，究竟什麼原因讓你感覺不安的卻又說不清楚，轉移注意力讓自己沒時間和心思去想別的事；工作方面即使想要去做好，但做出來的效果總不盡人意；父母的嘮叨讓原本鬱悶的心情更加容易發脾氣。','戀愛中的人應多與戀人互動，感情才能有更好的進展；單身者眼光別太高。','事業運不佳，雖然恨忙碌，可是似乎忙錯方向了，特別要注意可別為了個人單一的想法而累壞了自己也拖累了同事。','游手好閒者，要賺錢困難重重。','2020-09-03 03:25:01','2020-09-03 03:25:01'),(27,3,'2020-09-03',4,4,3,3,'愛情順利，單身者選擇今天向追求一段時日的對象表白，易如願以償。財運一般，對金錢的敏銳度不太高，玩金錢遊戲易失算。晚上約上好友去歌劇院看看現場表演，會感覺輕鬆愉快，還有機會結識新朋友。','愛情運勢旺，別板著臉，多一點自然的微笑，愛神就會眷顧你喔！','事業運普通，心態上有點陰晴不定，時而開心積極，時而沉默緩慢，是個變化多端的工作天。','普通的一天，專心的工作吧，不適合處理或規劃財務問題！','2020-09-03 03:25:02','2020-09-03 03:25:02'),(28,4,'2020-09-03',2,2,1,3,'情感波動較明顯，易因生活瑣事而與伴侶起爭執，不懂站在對方的立場思考，矛盾將難得調和。財運頗好，與人合作生意者易有不錯的收效。事業運欠佳，但仍存在轉機，付出加倍的努力，終能有所收獲。','已婚者不停的追蹤會讓另一半產生壓力，注意自己說話的語氣，可別像盤問犯人一樣唷！','工作上易遇到困難，不宜單打獨鬥，多與同事合作，可大大提升工作效率。','花錢時要謹慎評估一番，千萬別出手不計後果唷！','2020-09-03 03:25:02','2020-09-03 03:25:02'),(29,5,'2020-09-03',3,3,3,4,'對伴侶承諾的太多，但又沒見實際行動，這樣會讓他在心裡對你的誓言產生不信任；執著於思考一件事，反而讓頭腦很不清醒，理不出思緒；今天會有點偏財運，可去買彩券試試運氣。','與異性接觸的機會多，但真正的桃花還未出現，想要邂逅心儀的對象還需耐心等待。','遇到困難時別愁眉苦臉，也別只顧著埋頭苦幹，多運用人際關係會更易解決。','對於錢財的把握精準，採取速戰速決的投資戰略容易進財。','2020-09-03 03:25:03','2020-09-03 03:25:03'),(30,6,'2020-09-03',5,5,4,4,'體貼關心的言語用在另一半身上，對方回報你的是柔情蜜意。辦事細心嚴謹，加上務實的工作態度，能受到上級的肯定。多與客戶進行溝通，了解對方的真實想法，才能提供令對方更滿意的服務。出色的表現引來伯樂的青睞，有新的機會向你招手。','愛情運佳，多與伴侶聊一些感性、輕鬆的話題，讓互動變得生動、有趣，不難達成共識。','今日事業運還不錯呢，雖然辛苦了點，可是會有實質的進展喔！尤其是遇到瓶頸時，今日會有明顯的突破。','充滿機運的一天，出門在外容易遇到金主，有利洽商。作風保守的人，則不易感受到今日好運。','2020-09-03 03:25:04','2020-09-03 03:25:04'),(31,7,'2020-09-03',1,1,2,1,'尋求突破，但困難橫在眼前，讓你找不到施力點，不妨停下腳步重新思考並擬訂策略。財運較弱，投資理財需謹慎，易收到錯誤信息，在運作上別衝動。戀愛運不佳，單身者想戀愛需耐心等待，太快投入感情易受挫。','外力干擾會令你不得安寧，應用樂觀的心態看待眼前的戀情。','事業運略差，乖乖的聽命行事較好，有點有氣無力，持續力不太好，容易突然改變主意。','如果不是心情輕鬆、頭腦清晰，還是遠離一下賭場！','2020-09-03 03:25:04','2020-09-03 03:25:04'),(32,8,'2020-09-03',2,1,3,2,'一丁點大小的事情不必放在心上，與戀人相處要懂得調和，才能讓感情進展得更為順利。女生有衝動購物的傾向，對財運也會產生不小的影響，適當地控制慾望對留住錢財有所幫助。多看看理財之類的文章，會有不少心得體會。','向心儀的對象發出邀約易被拒絕，千萬別死纏爛打，應表示尊重與理解。','同情心泛濫，出門在外易上當受騙；工作上易遇到挫折，別被困難擊倒。','散財童子附身，守財不易。','2020-09-03 03:25:05','2020-09-03 03:25:05'),(33,9,'2020-09-03',4,4,3,3,'伴侶體貼入微的關懷，成為你今天的精神動力，對待事情的看法變得積極樂觀。工作中急於求成，反而會影響工作品質，增加重做的機率。健康方面，易感到頭昏腦脹，注意室內空氣的流通。','今日是個桃花日，有許多機會可以跟異性朋友談天玩樂。單身朋友好好把握今天吧！','事業運普通，是個耕耘之日，付出多少則回收多少。要有耐心一點，不然脾氣容易變得急躁。','今日快點把手頭上的錢處理掉，例如：拿去儲蓄、繳貸款，不要把信用卡帶在身上，否則容易把身邊的錢花光光！','2020-09-03 03:25:05','2020-09-03 03:25:05'),(34,10,'2020-09-03',3,4,3,2,'如需朋友或同事幫忙而對方有原因不方便幫時，切不可勉強人家，不然會弄得自己很尷尬或是弄得人家極不開心；單身者在朋友的Party中會對風趣幽默的異性比較留意；工作中對訂單的處理不確實，容易致使客戶所需貨物不能及時發出。','有伴侶的人感情平順，彼此照顧；單身者與能說會道的異性特別有緣，容易有新戀情。','說話要稍微注意場合，以免你的無心直言得罪了周圍的同事。','今日花錢特別海派，想要守住荷包就不要為了面子而請客大吃大喝。','2020-09-03 03:25:06','2020-09-03 03:25:06'),(35,11,'2020-09-03',3,1,4,3,'人際運較差，與左鄰右舍的交往還是要保持距離才好，閒話說得太多容易惹來紛爭。購物運還算順利，但是在交易的過程中，應多留意物品的保存期限，小心讓劣質商品敗壞了今天的心情。','伴侶間吵架機率高，兩人容易為了雞毛蒜皮的小事鬧彆扭，雙方都需要控制好情緒。','喜歡追求新鮮刺激，對新事物頗感興趣，挑戰新領域或新任務能讓你精神亢奮。','購物慾望強烈，應加以控制。','2020-09-03 03:25:06','2020-09-03 03:25:06'),(36,12,'2020-09-03',4,4,4,3,'愛心人士今天會遇到可愛的小動物，有強烈的領養念頭，可望從中找到樂趣。有晨跑習慣的單身者，有機會邂逅心儀的異性，戀情就在那回眸一笑中而生。工作中的你顯得太專注，而忽視了同事之間必要的問候。','戀愛運勢還不錯，想要戀愛的人，可以請長輩撮合；戀愛中人，用點小技巧逗逗對方吧！','今天同事會是你的大貴人，給予你工作很大助力，因感恩在心，有所表示。','財運穩中有升，多半得益於貴人相助。把握錢財貴人，可讓你事半功倍。','2020-09-03 03:25:07','2020-09-03 03:25:07');
/*!40000 ALTER TABLE `fortune` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-09-03 20:09:26
